import re
from os import environ

id_pattern = re.compile(r'^.\d+$')
def is_enabled(value, default):
    if value.lower() in ["true", "yes", "1", "enable", "y"]:
        return True
    elif value.lower() in ["false", "no", "0", "disable", "n"]:
        return False
    else:
        return default

class script(object):
    START_TXT = environ.get("START_TXT", '''<b>வண்ணகம் {} 👋🏻 இந்த பாட் அல்லது குழு உங்கள் கல்வி நோக்கத்திற்காக உருவாக்கப்பட்டது. எனவே உங்கள் நண்பர்களுடன் பகிர்ந்து கொள்ளுங்கள் மற்றும் அறிவை அறிந்து கொள்ளுங்கள் 👍.</b>''')
    HELP_TXT = """𝙷𝙴𝚈 {}
இதோ எனது உதவி கட்டளைகள்."""
    ABOUT_TXT = """<b>
╭────[ என்னை பற்றி ]────⍟
│
├⍟ என் பெயர் : <a href=https://t.me/Educatepurposebot><b>கல்வி பாட்</b></a>
├⍟ Owner : <a href=https://t.me/This_is_SandyBS><b>சந்தோஷ்</b></a>
├⍟ உரிமையாளர் : <a href=https://t.me/MR_X_MIRROR><b>தெரியாத நபர்</b></a>
├⍟ பதிப்பு : MR 1.0 [ நிலையானது ]
├⍟ சேவையகம் : சொந்த சர்வர்
├⍟ மொழி : Python 3.10.5
├⍟ கட்டமைப்பு : பைரோகிராம் 1.4.16
│
╰────[ <a href=https://t.me/+Q7a0Y5ZnbHAxOGU1><b>கோஜன் கல்வி</b></a> ]────⍟<b>"""
    SOURCE_TXT = """<b>இப்படி ஒன்றை உருவாக்கவும்:</b>
» நான் உங்களுக்காக ஒரு பாட் உருவாக்குவேன்<b>
» என்னை தொடர்பு கொள் @MR_X_MIRROR<b>"""
    MANUELFILTER_TXT = """Help: <b>வடிப்பான்கள்</b>

- வடிப்பான் என்பது பயனர்கள் ஒரு குறிப்பிட்ட முக்கிய வார்த்தைக்கு தானியங்கு பதில்களை அமைக்க முடியும் மற்றும் ஒரு முக்கிய சொல் கிடைக்கும் போதெல்லாம் Search Bot பதிலளிக்கும் அம்சமாகும்.

<b>குறிப்பு:</b>
1. Search Botக்கு நிர்வாகி சிறப்புரிமை இருக்க வேண்டும்.
2. நிர்வாகிகள் மட்டுமே அரட்டையில் வடிப்பான்களைச் சேர்க்க முடியும்.
3. எச்சரிக்கை பொத்தான்கள் 64 எழுத்துகளின் வரம்பைக் கொண்டுள்ளன.

<b>கட்டளைகள் மற்றும் பயன்பாடு:</b>
• /filter - <code>அரட்டையில் வடிப்பானைச் சேர்க்கவும்</code>
• /filters - <code>அரட்டையின் அனைத்து வடிப்பான்களையும் பட்டியலிடுங்கள்</code>
• /del - <code>அரட்டையில் குறிப்பிட்ட வடிகட்டியை நீக்கவும்</code>
• /delall - <code>அரட்டையில் உள்ள முழு வடிப்பான்களையும் நீக்கவும் (அரட்டை உரிமையாளர் மட்டும்)</code>"""
    BUTTON_TXT = """Help: <b>பொத்தான்கள்</b>

- Search Bot ஆனது url மற்றும் எச்சரிக்கை இன்லைன் பொத்தான்கள் இரண்டையும் ஆதரிக்கிறது.

<b>குறிப்பு:</b>
1. எந்த உள்ளடக்கமும் இல்லாமல் பொத்தான்களை அனுப்ப டெலிகிராம் உங்களை அனுமதிக்காது, எனவே உள்ளடக்கம் கட்டாயமாகும்.
2. Search Bot எந்த டெலிகிராம் மீடியா வகையிலும் பொத்தான்களை ஆதரிக்கிறது.
3. பட்டன்கள் மார்க் டவுன் வடிவமாக சரியாக அலசப்பட வேண்டும்

<b>URL buttons:</b>
<code>[Button Text](buttonurl:https://t.me/MROTTTamilOffl)</code>

<b>Alert buttons:</b>
<code>[Button Text](buttonalert:இது ஒரு எச்சரிக்கை செய்தி)</code>"""
    AUTOFILTER_TXT = """Help: <b>தானியங்கு வடிகட்டி</b>

<b>குறிப்பு:</b>
1. உங்கள் சேனல் தனிப்பட்டதாக இருந்தால், என்னை அதன் நிர்வாகியாக்குங்கள்.
2. உங்கள் சேனலில் கேம்ரிப்ஸ், ஆபாச மற்றும் போலி கோப்புகள் இல்லை என்பதை உறுதிப்படுத்தவும்.
3. மேற்கோள்களுடன் கடைசி செய்தியை எனக்கு அனுப்பவும்.
 அந்த சேனலில் உள்ள எல்லா கோப்புகளையும் எனது db இல் சேர்ப்பேன்."""
    CONNECTION_TXT = """Help: <b>இணைப்புகள்</b>

- வடிப்பான்களை நிர்வகிப்பதற்கு, bot ஐ PM உடன் இணைக்கப் பயன்படுகிறது
- இது குழுக்களில் ஸ்பேம் செய்வதைத் தவிர்க்க உதவுகிறது.

<b>குறிப்பு:</b>
1. நிர்வாகிகள் மட்டுமே இணைப்பைச் சேர்க்க முடியும்.
2. அனுப்பு <code>/connect</code> உங்கள் பிரதமருடன் என்னை இணைத்ததற்காக

<b>கட்டளைகள் மற்றும் பயன்பாடு:</b>
• /connect  - <code>ஒரு குறிப்பிட்ட அரட்டையை உங்கள் PM உடன் இணைக்கவும்</code>
• /disconnect  - <code>அரட்டையிலிருந்து துண்டிக்கவும்</code>
• /connections - <code>உங்கள் எல்லா இணைப்புகளையும் பட்டியலிடுங்கள்</code>"""
    EXTRAMOD_TXT = """Help: <b>கூடுதல் தொகுதிகள்</b>

<b>குறிப்பு:</b>
இவை தேடல் பாட்டின் கூடுதல் அம்சங்கள்

<b>கட்டளைகள் மற்றும் பயன்பாடு:</b>
• /id - <code>ஒரு குறிப்பிட்ட பயனரின் ஐடியைப் பெறுங்கள்.</code>
• /info  - <code>ஒரு பயனரைப் பற்றிய தகவலைப் பெறுங்கள்.</code>
• /imdb  - <code>IMDb மூலத்திலிருந்து திரைப்படத் தகவலைப் பெறவும்.</code>
• /search  - <code>பல்வேறு ஆதாரங்களில் இருந்து திரைப்படத் தகவலைப் பெறுங்கள்.</code>"""
    ADMIN_TXT = """Help: <b>நிர்வாக முறைகள்</b>

<b>குறிப்பு:</b>
இந்த தொகுதி எனது நிர்வாகிகளுக்கு மட்டுமே வேலை செய்யும்

<b>கட்டளைகள் மற்றும் பயன்பாடு:</b>
• /logs - <code>சமீபத்திய பிழைகளைப் பெற</code>
• /stats - <code>db இல் கோப்புகளின் நிலையைப் பெற.</code>
• /delete - <code>db இலிருந்து ஒரு குறிப்பிட்ட கோப்பை நீக்க.</code>
• /users - <code>எனது பயனர்கள் மற்றும் ஐடிகளின் பட்டியலைப் பெற.</code>
• /chats - <code>எனது அரட்டைகள் மற்றும் ஐடிகளின் பட்டியலைப் பெற </code>
• /leave  - <code>அரட்டையிலிருந்து வெளியேற வேண்டும்.</code>
• /disable  -  <code>அரட்டையை முடக்கவும்.</code>
• /ban  - <code>ஒரு பயனரை தடை செய்ய.</code>
• /unban  - <code>ஒரு பயனரை தடை செய்ய.</code>
• /channel - <code>இணைக்கப்பட்ட மொத்த சேனல்களின் பட்டியலைப் பெற</code>
• /broadcast - <code>அனைத்து பயனர்களுக்கும் ஒரு செய்தியை ஒளிபரப்ப</code>"""
    STATUS_TXT = """★ மொத்த கோப்புகள் : <code>{}</code>
★ மொத்த பயனர்கள் : <code>{}</code>
★ மொத்த அரட்டைகள் : <code>{}</code>
★ மொத்த சேமிப்பு : <code>{}</code> 𝙼𝚒𝙱
★ இலவச சேமிப்பு : <code>{}</code> 𝙼𝚒𝙱"""
    LOG_TEXT_G = """#புதிய குழு
    
<b>᚛› குழு ⪼ {}(<code>{}</code>)</b>
<b>᚛› மொத்த உறுப்பினர்கள் ⪼ <code>{}</code></b>
<b>᚛› இந்த நபரால் சேர்க்கப்பட்டது ⪼ {}</b>
<b>᚛› கோஜன் கல்வி </b>
"""
    LOG_TEXT_P = """#புதிய பயனர்கள்  
    
<b>᚛› ஐடி - <code>{}</code></b>
<b>᚛› பெயர் - {}</b>
<b>᚛› கோஜன் கல்வி </b>
"""
